Revit 2024 API
RebarUpdateCurvesData.HostMirrored Property
 If true, then host of the rebar was mirrorred (along with the rebar) before this regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public bool HostMirrored { get; set; }
Visual Basic
Public Property HostMirrored As Boolean
	Get
	Set
Visual C++
public:
property bool HostMirrored {
	bool get ();
	void set (bool value);
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace